Revit 2024 API
AssemblyMemberDifferentCategory Class
 The two assembly members being compared have different category
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class AssemblyMemberDifferentCategory : AssemblyMemberDifference
Visual Basic
Public Class AssemblyMemberDifferentCategory _
	Inherits AssemblyMemberDifference
Visual C++
public ref class AssemblyMemberDifferentCategory : public AssemblyMemberDifference
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentCategory
See Also
AssemblyMemberDifferentCategory Members
Autodesk.Revit.DB Namespace